# if语句小总结

# 单分支
# 获取小黎公交卡余额，如果小于１０元，充值１００
money = int( input("请输入小黎公交卡余额：") )
if money < 10:
    print("充值１００元")

# 双分支
# 月考成绩１００分满分，若不小于６０分，考试及格，可以进入下一阶段学习；否则，建议重新学习本阶段的内容
# if + elif
# if + else　－》Ｖ
grade = int(input("输入你的月考成绩："))
if grade >= 60:
    print("考试及格，通过，可以进行下一阶段的学习")
else:
    print("考试不及格，不通过，建议重新学习本阶段的内容")


# 如果第一阶段月考题分数大于９６分，赠送Ｐｙｔｈｏｎ小蛇纪念品
# 如果第二阶段月考题分数大于９０分，赠送Ｐｙｔｈｏｎ网络通信模型
# if + elif ?
# if + else　?
# if + if -> Ｖ
grade1 = int(input("第一阶段月考题分数:"))
grade2 = int(input("第二阶段月考题分数:"))
if grade1 > 96:
    print("赠送Ｐｙｔｈｏｎ小蛇纪念品")

if grade2 > 90:
    print("赠送Ｐｙｔｈｏｎ网络通信模型")


# 如果月考题成绩大于等于９０分，发一盒巧克力
# 如果月考题成绩大于８０但小于９０，奖励一朵玫瑰花
# if + else ?
# if + elif ->　ｖ
grade3 = int(input("输入月考成绩："))
if grade3 >= 90:
    print("发一盒巧克力")
elif grade3 > 80:
    print("奖励一朵玫瑰花")


# 多分支
# 如果月考题成绩大于等于９０分，发一盒巧克力
# 如果月考题成绩大于等于８０但小于９０，奖励一朵玫瑰花
# 如果月考题成绩大于等于７０但小于８０，奖励雪糕一块
# 如果月考题成绩大于等于６０但小于７０，奖励棒棒糖一块
# 其他情况，奖励便便锤图片

grd = int(input("获取月考成绩："))
if grd >= 90:
    print("发一盒巧克力")
elif grd >= 80:
    print("奖励一朵玫瑰花")
elif grd >= 70:
    print("奖励雪糕一块")
elif grd >=60:
    print("奖励棒棒糖一块")
else:
    print("奖励便便锤图片")





