"""
    循环
"""
# while : 满足一定条件后重复执行的语句
# 语法：
# while 是否满足条件的判断条件：
#     满足执行相应的内容
# else:
#     不满足条件时，执行的内容
# 注意事项：
# 1. else可以省略
# 2. break语句可以在特定条件下终止循环
# 3. continue语句在特定条件下，跳过某次循环，执行下一次的循环判断
# 嵌套：
# 满足一定条件时重复执行语句块Ａ内，　还需要重复执行另外的语句块Ｂ时，可以使用嵌套。




# for 用来遍历可迭代对象中的元素
# 语法：
# for 变量列表　in 可迭代对象：
#     使用遍历的元素，重复执行的内容
# else:
#     遍历完成后，执行的内容
# 注意事项：
# 1. 可迭代的对象：　字符串/列表/range
# 2. else子句可以省略
# 3. break语句可以在特定条件下终止循环
# 4. continue语句可以在特定条件下，跳过某一次循环，执行后续的内容
# 补充range语法
# range( 开始值，　结束值，　间隔值)
# 注意问题：
# 1. 开始值可以省略，默认值为０
# 2. 间隔值可以省略，默认值为１
# 3. 结束值不可省略，返回的数据值中不包含该结束值
# 嵌套
# 遍历可迭代对象Ａ重复执行的语句块内部，需要再次遍历其他迭代对象Ｂ时，使用嵌套。












